{
    "0": "I’ve joined Software Systems Lab of Taipei Tech, a lab whose members are mostly graduate students, for almost one year now. By now, I’ve learned agile development, test-driven design, and several kinds of testing (e.g. unit testing, integration testing, acceptance testing). Here is my github link(https://github.com/Nightlord851108). I’m currently the Scrum Master in a team of four in developing GeometrA( https://github.com/NTUTVisualScript/GeometrA.git ), an image-based tool for writing and executing automated acceptance tests for Android applications. Before that, I was working on ezScrum ( https://github.com/ezScrum/ezScrum ), another project developing in our lab, team, during the time, I've learned the knowledge about acceptance test. ",
    "1": "I'm currently the scrum master in a team of four, therefore, I've got chance not only work with my team mates, but also I have to analysis the problems and specs and plan the stories to work on for the coming sprint. In addition, since I'm the leader of this team, I'll need to pull my team mates back when they were going to be out of control. ",
    "2": "I'm very intereting in Computer Science and Software Engineering, and often spend lots of time to imporve my personal skills. I have I’ve taken upper-division courses including software requirements and specifications and software engineering. I have enjoyed learning several programming languages, including C/C++, Java, Python, Javascript, Ruby, and have put them to use in my various projects. Besides, I also worked with my team using scrum method, and designed the systems with TDD method to maintain the system quality. ",
    "3": "I’m currently the Scrum Master in a team of four in developing VisualScript, an image-based tool for writing and executing acceptance tests for Android applications. I’ve been with Software Systems Lab of Taipei Tech, a lab whose members are mostly graduate students, for almost one year now. By now, I’ve learned agile development, test-driven design, and several kinds of testing (e.g. unit testing, integration testing, acceptance testing). I’ve also taken upper-division courses including software requirements and specifications and software engineering. I have enjoyed learning several programming languages and have put them to use in my various projects. Besides, I've attended TCSE 2017 with ezScrum, a project of our lab, team to annouce using Scrum process and ezScrum tool. Besides, I've also posted a paper for Visual Script, the original version of GeometrA project which I'm currently the scrum master of, in Tanet 2017. ",
    "4": "When I first joined GeometrA team, the structure of the entire system was a mess, therefore, the first mission I'd done was redesigning the whole structure of the system and refactoring the code. ",
    "5": "People around me including my guiding professor, members of my project team, and my friends, often saids that I'm a hard working man, who always takes responsibility of the tasks he ",
    "6": "I'm always dreaming of working in a company that I could do programming whole day long, where I can feel very comfortable with the condition and the people. My biggest dream is the system/program I build is going to be used world-wide, so I can feel that there's a lot of users who want to use my program. ",
    "7": "Hello, I'm working for company. "
}
