[
    "Describe a time when you served as a project manager",
    "In a current job task, tell me about the steps you go through to ensure your decisions are correct/effective",
    "What do you do when you are faced with an obstacle to an important project?",
    "Tell us about a time when you took responsibility for an error and were held personally accountable",
    "What makes you interested in this position",
    "What do you consider your greatest strengths",
    "How did your college experience prepare you for a career in this field",
    "What are your proven coping mechanisms in challenging times",
    "Convince me you are the perfect match for our opening.",
    "How does your previous experience relate to the job we have open?",
    "What tools/applications/languages do you use?",
    "How would successful performance in this position be measured?",
    "Tell me about a project you did in your school. ",
    "Why should we hire you",
    "Describe a difficult work situation or project and how you overcame it. ",
    "What are your goals for the future?",
    "Are you the best person for this job? Why?",
    "Are you overqualified for this job?",
    "Describe a difficult experience at work and how you handled it.",
    "Describe yourself",
    "Describe your work style.",
    "Do you prefer to work alone or on a team?",
    "Give some examples of teamwork.",
    "How do you measure success?",
    "How would you describe yourself? ",
    "If the people who know you were asked why you should be hired, what would they say? ",
    "Is there a type of work environment you prefer?",
    "Tell me about yourself",
    "Tell me why you want to work here.",
    "What are you looking for in your next position?",
    "What are you passionate about?",
    "What are your goals for the future?",
    "What can you do for this company?",
    "What can you contribute to this company?",
    "What challenges are you looking for in your next job?",
    "What have you learned from your mistakes?",
    "What interests you about this job?",
    "What is your greatest strength?",
    "What is your greatest weakness?",
    "What major challenges have you handled?",
    "What problems have you encountered at work?",
    "What relevant experience do you have? ",
    "Why do you want this job?",
    "Why should we hire you?",
    "Where do you see yourself in five years?",
    "Out of all the other candidates, why should we hire you?",
    "Why do you want this job?",
    "What do you consider to be your biggest professional achievement?",
    "Describe your dream job.",
    "What kind of work environment do you like best?",
    "What is your leadership style?",
    "Tell me how you think other people would describe you.",
    "What do you like to do outside of work?",
    "With so many talented applicants, why should we hire you?",
    "What's your greatest career accomplishment so far?",
    "What would you like to achieve in this company?",
    "Do you consider yourself a team player?",
    "How do you feel about working nights and weekends?",
    "Tell me about your professional self and how you would fit in with the company.",
    "Why are you the right candidate for the job?",
    "What makes you the best choice for the position?",
    "What value would you bring to the job?",
    "Why are you interested in this position?",
    "Why do you want to work for us?",
    "Why do you want to work here?",
    "Can you list your strengths?",
    "Why should I consider hiring you?",
    "What motivates you?",
    "What makes a good team player?",
    "What are you looking for in terms of career development? ",
    "What are your lifelong dreams? ",
    "What do you ultimately want to become? ",
    "What are three positive things your last boss would say about you?",
    "What three character traits would your friends use to describe you? ",
    "Why did you choose your major? ",
]
