[
    "Tell me about a time you made a mistake in your college life.",
    "What is your dream job?",
    "How did you hear about this position?",
    "What would you look to accomplish in the first year on the job?",
    "Discuss your educational background.",
    "Tell me how you handled a difficult situation when you’re writing a program.",
    "Would you write a program on the weekend?",
    "Who are your competitors in your student life?",
    "What was your biggest failure about programming?",
    "What motivates you? Is your family be one of the factors?",
    "Who’s your mentor?Parents or school teacher?",
    "Tell me about a time when you disagreed with your teacher.",
    "How do you handle pressure?",
    "What are your career goals?",
    "Which on you want to be in your career?A leader or a follower?",
    "Do you like to work with other people?",
    "What are your hobbies?",
    "What is your favorite website?",
    "What kind of work place makes you uncomfortable?",
    "What kind of work place makes you happy?",
    "What are the proudest achievement about your leadership experiences?",
    "Tell me about a time when you had to work with a difficult colleague?",
    "What can you tell me about our company or industry?",
    "What is your favorite platform for Online Socializing?",
    "Describe your personal qualities.",
    "Are you a hardworking man?",
    "Are you a communicative man?",
    "Where do you see yourself in five years?",
    "What activities or internship have you participated in?",
    "What other companies are you interviewing with?",
    "What other companies are you interviewing with?",
    "What do you think we could do better or differently?",
    "How do you rate yourself as a professional?",
    "What do you think you are worth to us？",
    "What make you think you would be a success in this position？",
    "Are you a multi-tasked individual？",
    "What is your strongest trait?",
    "What personality traits do you admire？",
    "How do you normally handle criticism？",
    " What do you find frustrating in a work situation before?",
    "How do you handle your conflict with your colleagues in your work?",
    "How do you handle your failure？",
    "What provide you with a sense of accomplishment?",
    "What is most important in your life right now？",
    "What current issues concern you the most?",
    "Could you project what you would like to be doing five years from now?",
    "What is your ideal company?",
    "What attracted you to our company(LINE)?",
    "When were you most satisfied in your college life?"
]
